[
{"title": "Versace Men's VE2199", "brand": "Versace", "rating": "4.4 out of 5 stars", "price": "$185.93", "colour": "Black", "instock": false, "description": ["metal", "Plastic frame", "composite lens", "polarized", "Lens width: 56 millimeters", "Lens height: 48.9 millimeters", "Bridge: 18 millimeters", "Arm: 145 millimeters", "MATTE BLACK/GREY", "Size 56/18/145", "2-Year International Warranty", "Polarized"], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/510TaWIuRUL._AC_UL1000_.jpg"]},
{"title": "TIJN Blue Light Blocking Glasses Men Women Vintage Thick Round Rim Frame Eyeglasses", "brand": "TIJN", "rating": "4.4 out of 5 stars", "price": "$16.99", "colour": "(04)-tortoise", "instock": false, "description": ["plastic frame", "Composite lens", "non-polarized", "Lens width: 48 millimeters", "DIMENSION: Lens width:48MM, Bridge width:22MM, Arm length:145MM", "PROTECT YOUR EYE: Anti harmful blue light, 100%UV, screen flicker, anti-fatigue, provide all-day protection,without getting that harsh yellow found in other glasses", "MATERIAL:High quality acetate material, passed the CE certification", "DESIGN:Double stud accents and a keyhole nose bridge create a memorable look that's great for any outfit", "OUR SERVICE: We stick to pay attention to product quality, if there's any quality problems please feel free to contact us"], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/51zJS2QOg9L._AC_UL1100_.jpg"]},
{"title": "Livhò Blue Light Blocking Glasses,Computer Gaming Glasses, Anti Eyestrain/Filter Ray Lens, Sleep Better for Women Men", "brand": "livho", "rating": "4.3 out of 5 stars", "price": "$19.98", "colour": "*Light Black", "instock": false, "description": ["TR90 frame", "Anti-reflective lens", "non-polarized", "Lens width: 50 millimeters", "【BLUE LIGHT FILTER GLASSES】- Alleviates visual fatigue and discomfort from long periods of web surfing, gaming and working under fluorescent lights with UV400 protection and glare reduction.", "【REDUCE EYE STRAIN】- Extended exposure to blue light rays may cause fatigue and stress. Filtering out the HARMFUL Blue Light allows you to focus on your game or task on hand.", "【TRANSPARENT LENS】- Anti scratch, no color difference, bring you a real world.", "【LIGHTWEIGHT TR90 MATERIAL】- Super light and flexible TR90 nylon frame material for durability and comfortable long-term wearing. Casual frame design keeps you looking professional and stylish while working or playing video games.", "【30 DAYS MONEY BACK, LIFETIME WARRANTY】-100% risk free to try in case of any broken problem happening; just contact the seller without any hesitation to solve the problem until your satisfaction."], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/51jjpViiPLL._AC_UL1200_.jpg"]},
{"title": "SOJOS Polarized Sunglasses for Men Women Retro Aviator Square Goggle Classic Alloy Frame HERO SJ1126", "brand": "SOJOS", "rating": "4.5 out of 5 stars", "price": "$14.92", "colour": "C5 Gold Frame/Black Rim/Anti-blue Light Lens", "instock": false, "description": ["Metal frame", "Polycarbonate lens", "Non-polarized", "Lens width: 60 millimeters", "Bridge: 23 millimeters", "BLUE LIGHT BLOCKER & REPLACEABLE LENSES – Reduce symptoms of eyestrain during prolonged computer exposure. These glasses are best used for long hours of computer use to maintain natural sleep patterns and eye protection. The original lenses can be replaced with your prescription lenses at any store.", "HIGH-QUALITY MATERIALS – These SojoS square blue light blocking glasses are made of high-quality metal frames, anti-blue light lenses, reinforced metal hinges, exquisite temples, all the details ensuring you a long time using.", "UNIQUE FASHION DESIGN – These blue light blocking glasses bring you a timeless trendy appearance, and can go with various face shapes and hairstyles. You can wear our glasses for long periods in front of digital screens or your upcoming trip out of town.", "PRODUCT DIMENSION – Lens Width: 60mm(2.36inches) | Lens Height: 44mm(1.73inches) | Temple Length: 146mm(5.75inches) | Nose Bridge: 23mm(0.91inches).", "GIFT IDEAS PACKAGE – Blue light blocking glasses*1, microfiber pouch*1, microfiber glasses cleaning cloth*1, glasses box*1. It is also a gift packaged ready, making it a wonderful yet practical gift idea for friends and family!"], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/61CN-iGyq9L._AC_UL1500_.jpg"]},
{"title": "Cyxus Blue Light Filter Computer Glasses for Blocking Headache [Anti Eye Eyestrain] Transparent Lens Gaming Glasses, Unisex (Men/Women), Classic Black", "brand": "Cyxus", "rating": "4.2 out of 5 stars", "price": "$15.99", "colour": "Classic Black", "instock": false, "description": ["", "", "Make sure this fits", "", "by entering your model number.", "", "", "Best blue light blocking glasses-antii harmful blue ray, provide all-day protection, against the detrimental effect high Energy visible blue light and UV419.", "Dustproof PC lens-uvv blue light blocking glasses women/men are made of PC material, which is stronger and clearer, bring you good visual experience.", "Upgrade nose pads glasses- anti-blue glasses are stronger with five hinges and an enhanced nose pad, more suitable and pressure-free for you. You won't feel pain, and you won't have to worry about the traces on your nose.", "Reduce eyestrain & Sleep better-enjoyy your digital time, Not worry about eye fatigue, blurred vision and headache at all, blue light blocker for your eyes.", "Lifetime warranty-wee provide all blue light blocking glasses Lifetime warranty, You have no risk to try and we will provide you the best service!", "Voltage: 0.01"], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/51aa7RfJE7L._AC_SL1100_.jpg"]},
{"title": "SOJOS Fashion Round Sunglasses for Women Men Oversized Vintage Shades SJ2057", "brand": "SOJOS", "rating": "4.7 out of 5 stars", "price": "$14.98", "colour": "0c4 Tortoise Frame/Grey Lens", "instock": false, "description": ["Plastic frame", "Polycarbonate lens", "Non-polarized", "Lens width: 60 millimeters", "Bridge: 17 millimeters", "UV400 PROTECTION FOR YOUR EYES – SojoS's anti-glare lenses can block 100% of both UVA and UVB radiation. UV400 rated sunglasses are essential for filtering out sunlight reflected glare and protecting your eyes against long term UV damage when you go out.", "HIGH-QUALITY MATERIALS – These SojoS vintage round sunglasses are made of high-quality plastic frames, UV400 protection lenses, reinforced metal hinges, all the details ensuring you a long time using.", "FASHION UNIQUE DESIGN – There are several colors available for this round style sunglasses: black, brown, pink, blue, silver, and can go with various features and clothing. They are also the perfect choice for outdoor activities, such as driving, shopping, traveling, and so on.", "PRODUCT DIMENSION – Lens Width: 60mm(2.36inches) | Lens Height: 56mm(2.20inches) | Temple Length: 160mm(6.30inches) | Nose Bridge: 17mm(0.67inches).", "GIFT IDEAS PACKAGE – Sunglasses*1, microfiber pouch*1, microfiber glasses cleaning cloth*1, glasses box*1. It is also a gift packaged ready, making it a wonderful yet practical gift idea for friends and family!"], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/61-NHOSpllL._AC_UL1500_.jpg"]},
{"title": "MERRY'S Unisex Polarized Aluminum Sunglasses Vintage Sun Glasses For Men/Women S8286", "brand": "MERRY'S", "rating": "4.4 out of 5 stars", "price": "$12.91", "colour": "Blue", "instock": false, "description": ["metal frame", "Composite lens", "polarized", "Lens width: 56 millimeters", "Bridge: 16 millimeters", "POLARIZED LENS - Polarized sunglasses reduce glare reflected off of roads, bodies of water, snow, and other horizontal surfaces. Restore true color, eliminate reflected light and scattered light and protect eyes perfectly. Polarized sunglasses cut glare and haze so your eyes are more comfortable and you can see better.", "STYLE-2016 Newest Brand Design,It is Suitable For Any Face, Show Your Unique And High-end Taste.", "Suitable- Houseboat ,Driving, Running, Fishing,Racing, Skiing and Climbing, Trekking and Business Or Other Outdoor Activities Enthusiasts", "Lens Height:45MM(1.77 Inches)--Lens Width:56MM(2.20Inches)--Temple Length--140MM(5.51Inches)--Nose Bridge:16MM(0.63Inches)--Frame Length 142MM(5.59 Inches)", "30 DAY MONEY BACK GUARANTEE - All MERRY'S customers enjoy 30 Day Money Back Guarantee. Customers can return and get refunded in case the purchasing is not satisfactory for any reason. You have no risk to try and we will provide you the best service!"], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/61ZhLl-4JPL._AC_UL1500_.jpg"]},
{"title": "Gamma Ray Blue Light Blocking Glasses Amber Tint Anti Glare UV Digital Eyestrain", "brand": "GAMMA RAY OPTICS", "rating": "4.5 out of 5 stars", "price": "$17.99", "colour": "Black", "instock": false, "description": ["Plastic frame", "anti-reflective lens", "non-polarized", "Lens width: 53 millimeters", "Package Includes: 1 Pair – Computer Glasses with amber tinted lenses to minimize Digital Eye Strain caused by harmful blue light emitted from digital screens.", "Alleviates visual fatigue and discomfort from long periods of web surfing, gaming and working under fluorescent lights. These light sensitivity glasses also come with UV400 protection and glare reduction.", "Ultra-lightweight and flexible TR90 nylon frame material for durability and comfortable long-term wear. Casual frame design keeps you looking professional and stylish while working or playing video games.", "Your computer reading glasses magnification/power depends on how far you are from the screen you are viewing. For a laptop or desktop about 19+ inches away, select a magnification HALF your normal reading power. For a smartphone, tablet or a book about 12 to 18 inches away, select your normal reading power.", "Try today absolutely risk free with our 90 Days Money Back Satisfaction Guarantee and experience the quality under our Lifetime frame and lens breakage Warranty coverage. If the product does not work out for you, simply contact us for a full refund or replacement."], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/61iVUN7Hx2L._AC_UL1500_.jpg"]},
{"title": "Cyxus Blue Light Filter Computer Glasses for Blocking Headache [Anti Eye Eyestrain] Transparent Lens Gaming Glasses, Unisex (Men/Women), Classic Black", "brand": "Cyxus", "rating": "4.2 out of 5 stars", "price": "$15.99", "colour": "Classic Black", "instock": false, "description": ["", "", "Make sure this fits", "", "by entering your model number.", "", "", "Best blue light blocking glasses-antii harmful blue ray, provide all-day protection, against the detrimental effect high Energy visible blue light and UV419.", "Dustproof PC lens-uvv blue light blocking glasses women/men are made of PC material, which is stronger and clearer, bring you good visual experience.", "Upgrade nose pads glasses- anti-blue glasses are stronger with five hinges and an enhanced nose pad, more suitable and pressure-free for you. You won't feel pain, and you won't have to worry about the traces on your nose.", "Reduce eyestrain & Sleep better-enjoyy your digital time, Not worry about eye fatigue, blurred vision and headache at all, blue light blocker for your eyes.", "Lifetime warranty-wee provide all blue light blocking glasses Lifetime warranty, You have no risk to try and we will provide you the best service!", "Voltage: 0.01"], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/51aa7RfJE7L._AC_SL1100_.jpg"]},
{"title": "Uvex Skyper Blue Light Blocking Computer Glasses with SCT-Orange Lens (S1933X)", "brand": "Uvex", "rating": "4.1 out of 5 stars", "price": "$11.41", "colour": "not defined", "instock": false, "description": ["", "", "Make sure this fits", "", "by entering your model number.", "", "", "none", "Made in USA", "PROTECTS YOUR EYES: Orange Lens features Spectrum Control Technology (SCT) that absorbs 98% of blue light from laptops, computers & tablets, which helps prevent cataracts and macular degeneration", "REDUCES EYE FATIGUE: SCT-Orange lens reduces eye strain so you can work longer & more comfortably; also makes for more screen contrast with sharper details for improved focus and further reduced eye fatigue", "MULTI-ANGLE VIEWING: 3-Position lens inclination system allows for optimal screen viewing at different heights & positions; helps prevent neck strain while working, sitting, standing or stretched out", "WORK IN COMFORT: Adjustable-length Duoflex temples allow for custom, comfortable fit; temple tips are cushioned to prevent digging in to side of head; molded nose bridge rests easily on the face", "EASY LENS REPLACEMENT: Lens replacement is quick, easy and economical"], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/61gaYOD9E7L._AC_SL1500_.jpg"]},
{"title": "OCCI CHIARI Men Computer Glasses Blue Light Blocking Eyewear Fashion Optical Eyeglasses with Clear Lens", "brand": "OCCI CHIARI", "rating": "4.1 out of 5 stars", "price": "$19.99", "colour": "15040- Black", "instock": false, "description": ["Acetate frame", "Acrylic lens", "non-polarized", "Lens width: 54 millimeters", "Lens height: 35 millimeters", "Bridge: 16 millimeters", "Arm: 140 millimeters", "Measurement：Lens width-54mm(2.13’’),Bridge-16mm(0.63’’),Arm-140mm(5.51’’),Frame width-125mm(4.92’’),Frame height-35mm(1.38’’). The fashion product is designed in Italy for men,consisting of high quality durable,adjustable mental eyewear frame, and acrylic clear,non-polarized rectangular lenses，you can see the outside world clearly and prevent sand from entering the eyes.", "Non-prescription frame with clear glasses only,Rx-able eyewear ,no reading magnification,Rx Ready,lenses can be replaced with prescription lenses by your doctor.（myopia lenses, hyperopia lenses,anti blue light lenses,bifocal lens,progressive lenses）", "The product using life is more than 3 years after 42356 times of elastic spring leg testing. Durable flexible spring hinges perfectly fit different face size.And the high elastic spring leg can prevent it clip your face.", "The nose pads of the glasses fit the bridge of the nose, effectively preventing the glasses from slipping and imprinting the skin.The nose pads and hinges are designed to make the glasses less likely to fall off when you are looking down or exercising.", "We will send you some gifts as following: 1*free glasses pouch(about value $2.5),1*dust cleaning cloth(about value$1.00),they can help protect your glasses from dirt,so you will save your money,1* glasses case,which can be a exquisite gift sending to your families and friends.We promise that it is replaced in 30 days with a lifetime warranty!We will provide the best solutions until the customer is satisfied.You have no risk to try!"], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/514PGBmaDTL._AC_UL1500_.jpg"]},
{"title": "J+S Vision Blue Light Shield Computer Reading/Gaming Glasses - 0.0 Magnification - Anti Blue Light 100% UV Protection - Low Color Distortion Lens, Classic Rectangle Glossy Tortoise Frame", "brand": "J+S", "rating": "4.4 out of 5 stars", "price": "$24.99", "colour": "Low Color Distortion Lens - Tortoise Frame", "instock": false, "description": ["PROTECT YOUR EYES - High Energy Blue Light emitted by electronic devices (such as computers, TV, smartphones) have shown to increase the risk of vision conditions from sore dry eyes to macular degeneration. Maintain healthy eyes by reducing exposure to high energy blue light.", "IMPROVE PERFORMANCE AND PRODUCTIVITY - Extended exposure to blue light rays may cause fatigue and stress. Filtering out the High Energy Blue Light allows you to focus on your game or task at hand.", "BLOCKS 90% OF THE MOST HARMFUL BLUE LIGHT* - J+S Vision Blue Light Shield protects your eyes by filtering out 90% of the most harmful High Energy Blue Light (400nm - 430nm) rays while letting through the less harmful portion of the blue light spectrum. Overal blue block rate: Low Color Distortion lens = ~52%, HD lens = ~62%", "LOW COLOR DISTORTION LENS - Unlike other glasses on the market with heavily tinted lens. J+S Vision's low color distortion lens is optimised to provides the perfect balance between eye protection and viewing quality.", "QUALITY CLASSIC FRAME - The classic rectangular in tortoise is suitable for both male and female while covering large field of vision. Spring loaded temples allows for comfortable fitting for both large and small heads."], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/71adywzKjKL._AC_SL1500_.jpg"]},
{"title": "Carrera mens Ca1001/S Pilot Sunglasses", "brand": "Carrera", "rating": "4.5 out of 5 stars", "price": "$89.00", "colour": "Black White/Dark Gray Gradient", "instock": false, "description": ["Imported", "RX-able", "Plastic frame", "Non-polarized", "100% UV protection coating", "Branded case included"], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/71yMm7woAHL._AC_UL1500_.jpg"]},
{"title": "Ray-Ban RX4340V Wayfarer Eyeglass Frames", "brand": "Ray-Ban", "rating": "4.6 out of 5 stars", "price": "$173.00", "colour": "Shiny Black/Demo Lens", "instock": false, "description": ["propionate", "Imported", "Case included", "Lenses are prescription ready (rx-able)", "The Wayfarer frame is an iconic design and the most recognizable. This frame give an intellectual look and is well like by celebrities, artists and musicians"], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/515vXiMBAAL._AC_UL1500_.jpg"]},
{"title": "SOJOS Small Square Polarized Sunglasses for Men and Women Polygon Mirrored Lens SJ1072", "brand": "SOJOS", "rating": "4.5 out of 5 stars", "price": "$14.83", "colour": "C06 Gold Frame/Grey Lens", "instock": false, "description": ["Metal frame", "Composite lens", "Polarized", "Lens width: 51 millimeters", "Bridge: 20 millimeters", "UV400 PROTECTION FOR YOUR EYES – SojoS's anti-reflective sunglasses with HD polarized lenses can filter out sunlight reflected glare, and protect your eyes from long term damage by blocking 100% of harmful UVA and UVB rays.", "ULTRA-LIGHT AND ULTRA-THIN FRAME – These SojoS retro square sunglasses are made of ultra-thin metal materials, so the frames are super light but very strong. These weights are only 40 grams(0.09 pounds), so you will feel very comfortable and no pressure on your nose.", "PERFECT ALL ROUNDER – These SojoS sunglasses are the perfect choice for outdoor sports and activities such as taking photos, shopping, driving, walking, traveling, and are suitable as a high fashion accessory and daily wear all year round.", "PRODUCT DIMENSION – Lens Width: 51mm(2.01inches) | Lens Height: 45mm(1.77inches) | Temple Length: 147mm(5.79inches) | Nose Bridge: 20mm(0.79inches).", "GIFT IDEAS PACKAGE – Sunglasses*1, microfiber pouch*1, microfiber cleaning cloth*1, glasses box*1. It is also a gift packaged ready, making it a wonderful yet practical gift idea for friends and family!"], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/71MUXeRWf2L._AC_UL1500_.jpg"]},
{"title": "Oakley Men's Oo9406 Sutro Shield Sunglasses", "brand": "Oakley", "rating": "4.7 out of 5 stars", "price": "$166.00", "colour": "Matte Black/Prizm Road", "instock": false, "description": ["propionate", "Made in US", "Oakley Plutonite Lenses offer 100% UV Protection filtering of all UVA, UVB, UVC and harmful blue light up to 400mm. Oakley’s lightweight Plutonite lens material offers superior comfort, clarity & protection against impact and ultraviolet radiation.", "PRIZM Lens Technology designed to enhance color, contrast and detail so athletes can make the most of any activity. Prizm Road sport lenses designed to help you see subtle changes in road texture and quickly spot hazards like rocks and potholes in medium to bright light conditions. Ideal for cycling and running. Light transmission: 20%", "Patented High Definition Optics (HDO) provides superior optical clarity and razor-sharp vision at every angle.", "O Matter stress-resistant frame is lightweight & durable for all-day comfort & protection. Oakley’s injection molded thermoplastic O-Matter frame provides improved strength & flexibility over traditional acetate & is built to withstand shifting or deforming over time.", "Three-Point Fit: Comfort and performance that holds lenses in precise optical alignment. Contact only happens at the bridge of the nose and behind the temples.", "No slip Unobtanium nose pads for better grip when wet and a secure fit.", "Microbag included to clean and store your Oakley sunglasses.", "Visit the Oakley brand shop to view the entire Oakley assortment by clicking on the Oakley logo above."], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/51xjQLJJ5lL._AC_UL1500_.jpg"]},
{"title": "TIJN Blue Light Blocking Glasses Square Nerd Eyeglasses Frame Anti Blue Ray Computer Game Glasses", "brand": "TIJN", "rating": "4.3 out of 5 stars", "price": "$15.99", "colour": "(02)-Transparent", "instock": false, "description": ["☀DIMENSION:Lens width:53MM,Bridge width:18MM,Arm length:140MM", "☀MATERIAL: This frame has the advantages of super lightness, abrasion resistance, low friction coefficient and so on. Besides, it is metal hinge that is more stable", "☀TIJN BLUE LIGHT BLOCKING LENS(WITH YELLOW TINT) can effectively block 100% harmful UV rays and relieve our eye fatigue especially when watching TV and looking at computer", "☀DESIGN: A successful contrast between a retro square shape and futuristic clear finish, this frame is sure to turn heads wherever you go", "☀OUR SERVICE: We stick to pay attention to product quality, if there's any quality problems please feel free to contact us"], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/41pYLFFao6L._AC_UL1100_.jpg"]},
{"title": "Joopin Semi Rimless Polarized Sunglasses Women Men Retro Brand Sun Glasses", "brand": "Joopin", "rating": "4.4 out of 5 stars", "price": "$10.99", "colour": "Brilliat Black Simple Packaging", "instock": false, "description": ["Resin frame", "Composite lens", "polarized", "Lens width: 51 millimeters", "✔FACTORY DIRECTLY SUPPLY, THE MOST AFFORDABLE PRICE - Based on Joopin strong factory supply, every detail of Joopin womens mens sunglasses polarized is controlled and perfect. We directly provide finely Joopin fashion polarized sun glasses for women men to every customer with the most affordable price. Joopin is committed to make everyone could afford to wear their favorite sunnies", "✔PERFECT BROWLINE STYLE, DURABLE AND COMFORTABLE - Imported resin materials, sturdy metal plastic frame, soft silicone nose pads, double-burst metal hinges, HD polarized lens, perfect lightweight half frame sun shades creation that keeps you in love with it. Colorful frames and colorful mirrored lens, choose the loved color for your outfits when you go outside for shopping, beach, parties, driving, running, fishing, cycling, any outdoor activities", "✔ENJOY THE SUNSHINE AND BREATH THE NATURE - Wearing Joopin best sunglasses polarized, you never need to worry about the bright sunlight and high-energy visible light from damaging or discomforting your eyes. Joopin HD polarized lens reduce glare reflected of roads, bodies of water, snow, and other horizontal surfaces, and it restores the true color, with no distortion or deformation of color saturated images. Meanwhile, UV400 protection is essential for Joopin to protect your eyes", "✔JOOPIN INTIMATE SERVICE - All Joopin members are trying our best to serve every customer, every customer's satisfaction is our greatest motivation of efforts. 30 days refund, 24 hours service, please contact us if you have any issue with the horn rimmed sunglasses, Joopin will always be there for you", "✔EXQUISITE GIFT BOX PACKAGED- Joopin classic half frame sunglasses x 1 / Joopin exquisite bag x 1/ Joopin exclusive lens cloth x 1/ Joopin polarized testing card x1. It is gift packaged already, making it a wonderful yet practical festival gift idea for friends and family"], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/61zYQGbKDsL._AC_UL1500_.jpg"]},
{"title": "Peepers by PeeperSpecs Clark Square Reading Glasses", "brand": "Peepers by PeeperSpecs", "rating": "4.4 out of 5 stars", "price": "$22.69", "colour": "Black", "instock": false, "description": ["Imported", "Handsome contemporary Reading glasses in the season's hottest shape. Reading glasses are spring-hinged for added comfort.", "Aspheric lenses with anti-scratch coating", "Spring hinges for more comfortable fit", "Lenses are prescription ready (Rx-able)"], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/51sUXCEZv9L._AC_UL1368_.jpg"]},
{"title": "Huk Fishing Polarized Full Frame Sunglasses with Scratch Resistance and UV Protection", "brand": "HUK", "rating": "4.5 out of 5 stars", "price": "$49.99", "colour": "Matte Black / Smoke With Blue Mirror", "instock": false, "description": ["Imported", "Plastic frame", "Polycarbonate lens", "polarized", "HUK | Performance Fishing products to unite all anglers, from the first cast, to the last", "POLARIZED LENSES | Premium Polarized polycarbonate lenses block glare, provide superior clarity, and are scratch and impact resistant with 100% UV protection", "PERFORMANCE FRAMES | Injected TR90 frame material is strong, lightweight, and resiliently holds shape for lasting fit and comfort", "WRAP COVERAGE | 8-Base wrap for greater light blocking and active fit. Feature non slip rubber ends for added performance", "SIZE | Medium-Large fit"], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/61ILgoCgcZL._AC_UL1500_.jpg"]},
{"title": "CNLO Blue light blocking Glasses，Computer Glasses ，Radiation protection Gaming Glasses, for UV Protection, Anti Eyestrain, Lightweight Frame Eyewear，Men/Women (Crystal)", "brand": "CNLO", "rating": "4.5 out of 5 stars", "price": "$19.99", "colour": "Crystal", "instock": false, "description": ["", "", "Make sure this fits", "", "by entering your model number.", "", "", "☀TR90 FRAME,Strong and not easily deformed", "☀MORE THAN 92%HIGH TRANSMITTANCE LENS,Clearer view", "☀35% ANTI-BLUE LIGHT.Can effectively block harmful blue light from TV, mobile phone, computer, etc.Beneficial blue light can pass through", "☀UV400 PROTECTION,Non-ionizing ion radiation protection.", "☀PC LENS, strong impact will not be damaged"], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/51Z%2BZI6AnVL._AC_SL1300_.jpg"]},
{"title": "ATTCL Unisex Blue Light Blocking Glasses Eyeglasses Frame Anti Blue Ray Computer Game Glasses", "brand": "ATTCL", "rating": "4.5 out of 5 stars", "price": "$17.98", "colour": "Gold", "instock": false, "description": ["Imported", "Hong Kong", "metal frame", "Composite lens", "non-polarized", "Lens width: 54 millimeters", "Lens height: 45 millimeters", "Bridge: 18 millimeters", "Arm: 143 millimeters", "14g Ultra Light - ATTCL Blue Light Blocking Glasses,You can hardly feel them on your face, making your work easier!", "NO MORE TIRED EYES - Reduce eye strain, eye fatigue and sensitivity to light during long computer sessions. Allow your eyes to blink and function naturally. Great for office workers or anyone who has to look at a screen all day. Designed for all day comfort with a durable yet flexible frame. Whether youâ€re catching up on emails after a long day at work, or burning the midnight oil to finish a project - protect your eyes from excessive levels of blue light", "BLUE LIGHT BLOCKING LENS can effectively block ultraviolet radiation ,provide 100% UV400 protection and filter harmful blue light,it is suitable for use when watching TV and look at computer.", "30 DAY MONEY BACK GUARANTEE - All ATTCL computer glasses enjoy 30 Day Money Back Guarantee.You can return the defective products for repairing or exchanging for free at any time (if not man-made damage).Just contact seller by clicking below on our name and then click the ‘ask a question’ button."], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/710v2Ej9CVL._AC_UL1500_.jpg"]},
{"title": "YIMI Polarized Photochromic Driving z87 Sunglasses For Men Women Day and Night", "brand": "YIMI", "rating": "3.8 out of 5 stars", "price": "$21.89", "colour": "P0-ib7s-1kyd", "instock": false, "description": ["metal frame", "photochromatic lens", "polarized", "Lens width: 1.57 inches", "✅PHOTOCHROMIC DESIGN - YIMI is not just another pair of polarised sports sunglasses, but an essential part of sports equipment. The magical photochromic lenses are based on the intensity of sunlight and ultraviolet lights, darkening the light grey lens. What's more, these glasses can protect eyes without interfering with your perception of colour.Polarized sunglasses cut glare and haze so your eyes are more comfortable and you can see better.", "✅UV400 POLARIZED PROTECTIVE LENSES - The polarized lens is anti-UV.100% UV400 protection coating, blocks 100% harmful UVA & UVB Rays and protect eyes perfectly.YIMI sunglasses are superior to other sunglasses- when moving indoors or outdoors, the lenses adjust to the reduced lighting conditions automatically.and the polarised lenses reduce flare and glare.it's perfect for cycling, running, fishing, driving, mountaineering, skiing or hiking, this sports sunglasses is also your fashion accessories", "✅LIGHTWEIGHT & SAFER EXPERIENCE. - One of the most annoying things about the metal sunglasses is that they could get too heavy. Added up with soft silicone nose pads, these glasses are constructed using special design techniques, ensure that you can stay at comfortable and safe at outdoor activities.it's also helpful to protect your eye and reduce eye fatigue. We focus on better and safer user experience, especially driving. It will filter out the dazzling light.", "✅TOP-END Sunglasses Technology: YIMI is not just another pair of polarised sports sunglasses, but an essential part of sports equipment. YIMI top-end sunglasses technology on lens and frame delivers highly durable and flexible solutions for maximum performance even on toughest occasions. It's perfect sports sun glasses for mens and womens.", "✅LIFETIME & Money Back: Every polarized sunglasses come backed by a 100% for reliability and total satisfaction. Love your eyewear or your money back!YIMI provides lifetime after sale service for all YIMI sunglasses in case the purchasing is not satisfactory. Contact and you will get response within 24 hours! You have NO RISK to try."], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/61qxVKRK8rL._AC_UL1500_.jpg"]},
{"title": "Versace Women's VE1163M Eyeglasses", "brand": "Versace", "rating": "4.5 out of 5 stars", "price": "$116.99", "colour": "Pale Gold", "instock": false, "description": ["Metal frame", "composite lens", "non-polarized", "Lens width: 52 millimeters", "Bridge: 16 millimeters", "Arm: 130 millimeters", "Model: VE1163M | Color: 1252 Eyeglass Frame PALE GOLD w/ Clear Demo Lens", "EyeSize 52mm/ Bridge 16mm/ Temple 130mm", "Made in Italy | Authorized Dealer | Buy With Confidence"], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/51O2klii-iL._AC_UL1000_.jpg"]},
{"title": "Gaoye Blue Light Blocking Glasses Women/Men, Spring Hinge TR90 Frame Anti Glare UV Filter Computer Gaming Glasses - GY1806", "brand": "Gaoye", "rating": "4.4 out of 5 stars", "price": "$16.99", "colour": "Light Black/Transparent Lens", "instock": false, "description": ["TR90 frame", "Anti-reflective lens", "Non-polarized", "Lens width: 51 millimeters", "🎅【BLUE LIGHT FILTER GLASSES】-Blue light blocker & UV400 lenses help you resist 100% harmful blue light & UVA/UVB rays, cut discomfort from web surfing, gaming and working under fluorescent lights. Restore true color, eliminate reflected or scattered light. Reduce headache glare eyestrain to protect your eyes and help sleep better.", "🎅【FLEXIBLE TR90 FRAME】-Extremely durable and super lightweight, you can barely feels its presence, which makes it comfortable to wear for a long time. Classic design, suitable for both women and men, high grade of frames. Let GAOYE help you decorate your day!", "🎅【NEWEST TECHNOLOGY】-Retractable Spring Hinge, fit more perfect on any occasion,such as Driving, Sporting, Fishing, Racing, Trekking and Business Or Other Outdoor Activities. Casual & retro frame design keeps you looking professional and stylish while working,gaming,watching TV or reading.", "🎅【PRODUCT DIMENSION】-Lens Width: 51mm(2.01inches) | Lens Height: 39mm(1.54inches) | Temple Length: 145mm(5.71inches) | Nose Bridge: 16mm(0.63inches).", "🎅【LIFETIME WARRANTY】-100% risk free to try any broken problem happens; just contact the seller without any hesitation to solve the problem until you are satisfied.You have no risk to try!"], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/511RD4MvSzL._AC_UL1200_.jpg"]},
{"title": "Gucci GG0340S", "brand": "Gucci", "rating": "4.7 out of 5 stars", "price": "$194.95", "colour": "Green Multicolor", "instock": false, "description": ["acetate", "Plastic frame", "composite lens", "non-polarized", "Lens width: 58 millimeters", "Bridge: 17 millimeters", "Arm: 150 millimeters", "Male model", "Acetate", "Model: GG-0340-S 006", "Color: Shiny Black, Dark Green", "Grey lens"], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/51iJiu6vLjL._AC_UL1500_.jpg"]},
{"title": "Ray-Ban Rb3016 Clubmaster Square Sunglasses", "brand": "Ray-Ban", "rating": "4.3 out of 5 stars", "price": "$204.00", "colour": "Black/Polarized Green", "instock": false, "description": ["plastic", "Imported", "CLASSIC CLUBMASTER SUNGLASSES: The Ray-Ban Clubmaster has an iconic look, shape, feel, and style. Worn by cultural intellectuals and Hollywood superstars, these superior glasses are both comfortable and fashionable.", "100% UV PROTECTION: To protect your eyes from harmful UV rays, these sunglasses include lenses that are coated with 100% UV protection.", "POLARIZED SUNGLASSES: These sunglasses feature the legendary Ray-Ban polarized lenses that improve clarity and contrast, while reducing glare and eye-strain. Made from high-quality scratch-resistant glass.", "DURABLE ACETATE FRAMES: Our professional Ray-Ban glasses feature lightweight yet durable acetate frames. The shape and curvature may need adjustment for precision fit.", "MULTIPLE FRAME AND LENS COLORS: Choose from multiple colors of frames—including black and tortoise—and lenses—including non-polarized and polarized, mirrored and gradient options. Made from high-quality glass, Ray-Ban lenses are prescription ready.", "MULTIPLE SIZE OPTIONS: Choose from a variety of size options including 49mm & 51mm.", "CASE & LENS CLOTH INCLUDED: Each pair of Ray-Ban sunglasses come with a case and lens cloth to clean and protect them from scratches and damage.", "VISIT THE RAY-BAN BRAND SHOP: Click on the Ray-Ban logo above to view the entire Ray-Ban brand assortment."], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/51PkI6mwzoL._AC_UL1500_.jpg"]},
{"title": "Bose Frames - Audio Sunglasses with Open Ear Headphones, Black, with Bluetooth Connectivity", "brand": "not specified", "rating": "4.3 out of 5 stars", "price": "$159.00", "colour": "not defined", "instock": false, "description": ["Sunglasses with built-in Bose speakers that produce rich, immersive sound for you, while others hear practically nothing. The apps that work with bose frames are Spotify,Apple music,Skype and WhatsApp, Google Maps or Waze", "Open-ear audio allows you to stay aware of your surroundings, while enjoying your music", "Bose Frames Rondo feature rounded lenses for a distinct look. Lens Width: 51 mm | Bridge Width: 22 mm | Temple Length: 135 mm", "Integrated microphone for clear calls and access to your phone’s virtual assistant", "Personalized settings, access to future updates, and more available through the Bose Connect app. Bluetooth connectivity for easy pairing", "Blocks up to 99% of UVA/UVB rays", "Battery Life: 3.5 hours streaming; 12 hours on standby. Charge Time: 2 hours", "Bluetooth Range: 30 ft. or 9 m", "Compatible Operating Systems: iOS: 9.0 or newer/ Android: 5.0 or newer"], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/61GVdknTJfL._AC_UL1500_.jpg"]},
{"title": "Ray-Ban Rb4165 Justin Rectangular Sunglasses", "brand": "Ray-Ban", "rating": "4.4 out of 5 stars", "price": "$157.00", "colour": "Black Rubber/Orange Mirror", "instock": false, "description": ["Composite, Plastic Frame.", "Imported", "UNISEX CLASSIC RECTANGULAR SUNGLASSES: The Justin RB4165 is a classic unisex pair of sunglasses. Made from high-quality plastic frames and durable prescription-ready glass lenses, these Ray-Bans are comfortable, fashionable, and long lasting.", "100% UV PROTECTION: To protect your eyes from harmful UV rays, these sunglasses include lenses that are coated with 100% UV protection.", "LIGHTWEIGHT PLASTIC FRAMES: Our Justin unisex sunglasses are inspired by the iconic Wayfarer sunglasses. The style is redesigned with slightly larger rectangular lenses.", "LIGHTWEIGHT LENSES: These Ray-Ban sunglasses feature high-quality, light-weight lenses that help reduce eye strain while outdoors.", "MULTIPLE FRAME AND LENS COLORS: Choose from multiple frame colors-including black and tortoise-and lens colors and treatments including polarized, gradient and mirrored. Find a color combination that fits your personal brand and style.", "MADE IN ITALY", "CASE & LENS CLOTH INCLUDED: Each pair of Ray-Ban sunglasses come with a case and lens cloth to clean and protect them from scratches and damage.", "VISIT THE RAY-BAN BRAND SHOP: Click on the Ray-Ban logo above to view the entire Ray-Ban brand assortment."], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/51AXV5IweKL._AC_UL1500_.jpg"]},
{"title": "Livho Blue Light Blocking Glasses, Anti Glare UV Filter Square Metal Lightweight Computer Gaming Eyeglasses for Women Men - LI1804 (Gold Black Frame/Transparent Lens)", "brand": "Livhò", "rating": "4.3 out of 5 stars", "price": "$25.00", "colour": "Gold Black Frame/Transparent Lens", "instock": false, "description": ["", "", "Make sure this fits", "", "by entering your model number.", "", "", "[BLUE LIGHT FILTER GLASSES] - Bluelight blocker, anti 98% of harmful blue light and discomfort from long periods of web surfing, tv, phone, tablet, vedio, reading and working under fluorescent lights with UV400 reduction, reduce headache, fatigue & eye strain, give you sleep better.", "[RESIN LENS] - Transparent lens, no color difference. Anti scratch and explosion-proof, protect your eyes in all direction, bring you good visual experience.", "[LIGHTWEIGHT METAL FRAME] - Only 15g, super light and durable TITANIUM frame makes you feel like a piece of feather on your skin, comfortable long-term wearing. Super high-grade material, whether office, leisure or travel, it can be perfectly integrated into your life.", "[PRODUCT DIMENSION] - Lens Width: 50mm(1.97inches) | Lens Height: 37mm(1.46inches) | Temple Length: 145mm(5.71inches) | Nose Bridge: 18mm(0.71inches).", "[LIFETIME WARRANTY]: 100% risk-free shopping. If you have any questions about the product, please feel free to contact us."], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/51PGtC5tnzL._AC_SL1200_.jpg"]},
{"title": "MERRY'S Men's Polarized Driving Sunglasses For Men Unbreakable Frame UV400 S8513", "brand": "MERRY'S", "rating": "4.5 out of 5 stars", "price": "$16.98", "colour": "Gray", "instock": false, "description": ["metal frame", "Composite lens", "polarized", "Lens width: 61 millimeters", "Bridge: 14 millimeters", "POLARIZED LENS - Polarized sunglasses reduce glare reflected off of roads, bodies of water, snow, and other horizontal surfaces. Restore true color, eliminate reflected light and scattered light and protect eyes perfectly. Polarized sunglasses cut glare and haze so your eyes are more comfortable and you can see better.", "STYLE-2016 Newest Brand Design,It is Suitable For Any Face, Show Your Unique And High-end Taste.", "Suitable- Houseboat ,Driving, Running, Fishing,Racing, Skiing and Climbing, Trekking and Business Or Other Outdoor Activities Enthusiasts", "Lens Height:50MM(1.97 Inches)--Lens Width:61MM(2.40Inches)--Temple Length--132MM(5.20Inches)--Nose Bridge:14MM(0.55Inches)--Frame Length 142MM(5.59 Inches)", "30 DAY MONEY BACK GUARANTEE - All MERRY'S customers enjoy 30 Day Money Back Guarantee. Customers can return and get refunded in case the purchasing is not satisfactory for any reason. You have no risk to try and we will provide you the best service!"], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/515W%2B6916-L._AC_UL1500_.jpg"]},
{"title": "Gamma Ray Blue Light Blocking Glasses Amber Tint Anti Glare UV Digital Eyestrain", "brand": "GAMMA RAY OPTICS", "rating": "4.5 out of 5 stars", "price": "$17.99", "colour": "Black", "instock": false, "description": ["Plastic frame", "anti-reflective lens", "non-polarized", "Lens width: 53 millimeters", "Package Includes: 1 Pair – Computer Glasses with amber tinted lenses to minimize Digital Eye Strain caused by harmful blue light emitted from digital screens.", "Alleviates visual fatigue and discomfort from long periods of web surfing, gaming and working under fluorescent lights. These light sensitivity glasses also come with UV400 protection and glare reduction.", "Ultra-lightweight and flexible TR90 nylon frame material for durability and comfortable long-term wear. Casual frame design keeps you looking professional and stylish while working or playing video games.", "Your computer reading glasses magnification/power depends on how far you are from the screen you are viewing. For a laptop or desktop about 19+ inches away, select a magnification HALF your normal reading power. For a smartphone, tablet or a book about 12 to 18 inches away, select your normal reading power.", "Try today absolutely risk free with our 90 Days Money Back Satisfaction Guarantee and experience the quality under our Lifetime frame and lens breakage Warranty coverage. If the product does not work out for you, simply contact us for a full refund or replacement."], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/61iVUN7Hx2L._AC_UL1500_.jpg"]},
{"title": "Gobiger Aviator Sunglasses for Men 100% UV Protection Goggle Alloy Frame with Case", "brand": "GOBIGER", "rating": "4.2 out of 5 stars", "price": "$12.99", "colour": "Gold Frame", "instock": false, "description": ["【Gobiger sunglasses can block 100% of both UVA and UVB radiation.】 UV400 rated sunglasses is essential to protecting your eyes against long term UV damage and keeping your eyes healthy when you go out.", "【Gobiger sunglasses is made of high quality metal material 】reinforced metal hinges that is durable enough for long time using. They are suitable for any climate and weather conditions.", "【Gobiger sunglasses is the perfect choice for outdoor activities】 such as walking, fishing, driving, shopping, travelling, skiing, taking photos, and is suitable as high fashion accessory and daily wear in spring ,summer,autumn and winter. It is also gift packaged ready, making it a wonderful yet practical gift idea for friends and family!", "【30 DAY MONEY BACK GUARANTEE-100% satisfaction guaranteed】---- If for any reason you are unsatisfied, just email us and you will receive a courteous and prompt refund.", "【Includes: 1*Glasses,1*Glasses case,1*Glasses cloth,1*Glasses pouch】Gobiger sunglasses Cool designer sunglasses for mens and womens"], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/717JOE0ks7L._AC_UL1500_.jpg"]},
{"title": "SUNGAIT Ultra Lightweight Rectangular Polarized Sunglasses UV400 Protection", "brand": "SUNGAIT", "rating": "4.6 out of 5 stars", "price": "$15.99", "colour": "2020 Gunmetal Frame Gray Lens", "instock": false, "description": ["Lightweight Al-Mg Alloy Metal frame", "Composite-UV400 lens", "polarized", "Lens width: 62 millimeters", "Bridge: 16 millimeters", "Polarized sunglasses - 100% Protection Against Harmful UVA/UVB & UVC Rays", "Fashion Metal Frame - Lightweight and Strong rectangular polarized sunglasses", "Lens Height: 42 mm (1.65 inches) | Lens Width: 62 mm (2.42 inches) | Nose Bridge: 16 mm (0.63 inches) | Temple Length: 135 mm (5.31 inches) | Frame Length: 144 mm (5.67 inches)", "Includes: 1*Cleaning cloth, 1*Sunglasses pouch and 1* Mini Screwdriver", "Lifetime Breakage Warranty and Money Back Guarantee"], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/61PmcMlhksL._AC_UL1500_.jpg"]},
{"title": "SIPLION Men's Polarized Sunglasses Sports Glasses for Cycling Fishing Golf TR90 Superlight Frame", "brand": "SIPLION", "rating": "4.2 out of 5 stars", "price": "$24.00", "colour": "Black Frame/Black Lens（not Mirrored）", "instock": false, "description": ["Imported", "REMARKABLE EYE PROTECTION and Comfortable: 100% Polarized and blocks UVA, UVB and harmful blue lights. Thoughtful and Ergonomic Design offers high comfort thanks to our exclusive smart technology.", "POLARIZED LENS - 100% UV400 protection coating, blocks 100% harmful UVA & UVB Rays. Polarized sunglasses reduce glare reflected off of roads, bodies of water, snow, and other horizontal surfaces. Restore true color, eliminate reflected light and scatteredht and protect eyes perfectly. Polarized Sunglasses cut glare and haze so your eyes are more comfortable and you can see better.", "SIPLION Polarized sunglasses for men Sports Sunglasses are made of our Newest Unbreakable and highly Stress-Resistant Material of TR90. It perfectly resolves the breaking issues that many sellers are constantly having to deal with. Most importantly, even with our newest technology the sunglass still continue to be both lightweight and durable for all-day comfort and protection", "SUPERLIGHT, STYLISH, DURABLE- Lightweight design is ideal for usage by motorcycle and cycling bicycle, driving, running, fishing, racing, skiing, climbing, trekking or other outdoor activities enthusiasts.", "RISK FREE AFTER-SALE SERVICE - All SIPLION Sun glasses enjoy 30 Day Money Back Guarantee.You can return the defective products for repairing or exchanging for free at any time (if not man-made damage).Just contact seller by clicking below on our name and then click the ‘ask a question’ button."], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/71sI1r%2BPKqL._AC_UL1500_.jpg"]},
{"title": "ANRRI Blue Light Blocking Glasses Lightweight Eyeglasses Frame Filter Blue Ray Computer Game Glasses", "brand": "ANRRI", "rating": "4.6 out of 5 stars", "price": "$25.95", "colour": "Classic Black", "instock": false, "description": ["REDUCE EYESTRAIN - Enjoy your digital time, NO worry about eye fatigue, blurred vision and headache.", "ANTI BLUE LIGHT - Cut 90% of the blue light. Relieving eye fatigue, dry and vision falling.", "BETTER SLEEP - Reduce eye strain and headache, so you can enjoy a restful deeper sleep", "MATERIAL - Frame: TR90 ; Lens: Polycarbonate (Non-Prescription)", "LIFETIME WARRANTY--We provide worry-free lifetime warranty and friendly customer service."], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/51%2BHjpuyRAL._AC_UL1500_.jpg"]},
{"title": "Shiratori New Vintage Fashion Half Frame Semi-Rimless Clear Lens Glasses", "brand": "Shiratori", "rating": "4.4 out of 5 stars", "price": "$8.99", "colour": "Black", "instock": false, "description": ["metal frame", "Composite lens", "non-polarized", "Lens width: 53 millimeters", "Imported Designer Inspired Frame", "plastic frame", "plastic lens", "English Style Nose Pieces", "Reinforced Metal Hinges"], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/51rU768fofL._AC_UL1000_.jpg"]},
{"title": "Ray-Ban Rx7021 Mathew Rectangular Prescription Eyeglass Frames", "brand": "Ray-Ban", "rating": "4.5 out of 5 stars", "price": "$89.95", "colour": "Rubber Black/Demo Lens", "instock": false, "description": ["Model: RX7021 | Color: 5364 Eyeglasses Rubber Black w/ clear demo Lens 55mm", "EyeSize 55mm/ Bridge 14mm/ Temple 140mm", "Imported/ Authorized Retailer/ Buy with Confidence"], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/51mJTPBimhL._AC_UL1500_.jpg"]},
{"title": "Shiratori New Vintage Fashion Half Frame Semi-Rimless Clear Lens Glasses", "brand": "Shiratori", "rating": "4.4 out of 5 stars", "price": "$8.99", "colour": "Black", "instock": false, "description": ["metal frame", "Composite lens", "non-polarized", "Lens width: 53 millimeters", "Imported Designer Inspired Frame", "plastic frame", "plastic lens", "English Style Nose Pieces", "Reinforced Metal Hinges"], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/51rU768fofL._AC_UL1000_.jpg"]},
{"title": "Polarized Sunglasses for Men Retro - FEIDU Polarized Retro Sunglasses for Men FD2149", "brand": "FEIDU", "rating": "4.4 out of 5 stars", "price": "$11.99", "colour": "1-black-matte", "instock": false, "description": ["Composite frame", "Composite lens", "polarized", "Lens width: 60 millimeters", "★FEIDU POLARIZED SUNGLASSES FOR MEN , Theses polarized sunglasses for men are made from first class material. And fully UV400 protection, can protect your eyes with full angle. And without distort color. Give you a HD world.", "★POLARIZED LENS PROTECT EYES AND REVERT TRUE COLOR the Polarized sunglasses lens for these polarized sunglasses for men are specifically designed for effectively eliminate and filter the scattered light in the beam, avoid the occurrence of glare.Make the view clear and natural, making the scenery look soft and not dazzling.", "★STYLISH CLASSIC FRAME DESIGN These polarized sunglasses for men are designed with the classic retro shape element. Lead you to the edge of the time. Increase your attraction. Add another point to your charm. Definitely your best choice for sunglasses and fashion accessory.", "★LIGHT-WEIGHT MATERIAL Integral nose pads, ergonomic design frame, make it more comfortable while you are wearing these sunglasses for men. Reinforced metal hinge and classic design make these polarized sunglasses for men can fit almost every kind of face shape and also make it more comfortable and durable.", "★30 Day Money Back For Any Reason In case any accident of the shipping or unexpected damage happened to these polarized sunglasses for men. Please contact us without hesitation to solve the problem until satisfaction. You have no risks to try. And we will provide best product and customer service to you."], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/61zL8epmQtL._AC_UL1100_.jpg"]},
{"title": "Livho 2 Pack Blue Light Blocking Glasses, Computer Reading/Gaming/TV/Phones Glasses for Women Men,Anti Eyestrain & UV Glare (Light Black+Clear)", "brand": "Livhò", "rating": "4.3 out of 5 stars", "price": "$16.98", "colour": "*B1 Light Black+Clear", "instock": false, "description": ["", "", "Make sure this fits", "", "by entering your model number.", "", "", "【PROTECTION FOR YOUR EYES】 -Alleviates visual fatigue and discomfort from long periods of web surfing, gaming and working under fluorescent lights with UV400 protection and glare reduction.", "【REDUCE EYESTRAIN】 -Enjoy your digital time, No worry about eye fatigue, blurred vision and headache.", "【BETTER SLEEP】-Amber tint lenses block more blue rays than others and see more realistic. You'll never have trouble with sleeping again.", "【EXCELLENT TR90 MATERIAL】-Ultra-lightweight and flexible TR90 nylon frame material for durability and comfortable long-term wearing. Casual frame design keeps you looking professional and stylish while working or playing video games.", "【LIFETIME WARRANTY】: 100% risk-free shopping. If you have any questions about the product, please feel free to contact us."], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/51QbFHJTguL._AC_SL1200_.jpg"]}
]